sim/analysis/amr/1000000/ngP_01_01_1_4_4/250_40_1/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
defaultFieldValues
(
    volScalarFieldValue T 300 // [K]
    volScalarFieldValue p 101325 // [Pa]
);

regions
(
    boxToCell
    {
        box (0 0 -0.001) (0.001 0.04 0);
        fieldValues
        (
				volScalarFieldValue T 3000 // [K]
                volScalarFieldValue p 2.0265e6 // [Pa]
        );
    }
);


// ************************************************************************* //
